#+TITLE: Database. replication

*** Remove the pre-last column on Slave (SYNC IS STOPED)

1. Find the pre-last column

#+begin_src shell :session *db*
d_mysql mysql_master "DESC tasks;"
#+end_src

#+RESULTS:
| Field       | Type         | Null | Key | Default | Extra          |
| task_id     | int(11)      | NO   | PRI | NULL    | auto_increment |
| title       | varchar(255) | NO   |     | NULL    |                |
| description | text         | YES  |     | NULL    |                |

1. Remove pre-last column `title`

   #+begin_src shell
d_mysql mysql_master "ALTER TABLE tasks DROP COLUMN title;"
   #+end_src

   #+RESULTS:

2. Run permanent insertion without `description` field

#+begin_src shell :session *db*

while :
do
    d_mysql mysql_master "insert into tasks (title) values (\"title_v2\");"
    sleep 2
done

#+end_src
